{
  "text": {
    "chào": 14,
    "xin": 83,
    "hey": 30,
    "hello": 29,
    "bạn": 11,
    "tạm": 74,
    "biệt": 6,
    "hẹn": 33,
    "gặp": 27,
    "lại": 42,
    "bye": 9,
    "mai": 44,
    "nói": 51,
    "chuyện": 13,
    "tiếp": 63,
    "đúng": 85,
    "có": 19,
    "vâng": 79,
    "phải": 52,
    "chính": 16,
    "xác": 84,
    "sai": 55,
    "không": 36,
    "chưa": 18,
    "cảm": 20,
    "thấy": 60,
    "rất": 54,
    "tuyệt": 69,
    "vời": 81,
    "tôi": 71,
    "ổn": 89,
    "khỏe": 37,
    "tốt": 76,
    "vui": 78,
    "buồn": 8,
    "chán": 15,
    "quá": 53,
    "tệ": 75,
    "bot": 7,
    "là": 40,
    "ai": 1,
    "người": 46,
    "hay": 28,
    "nhiệt": 48,
    "độ": 87,
    "hiện": 31,
    "tại": 73,
    "bao": 3,
    "nhiêu": 47,
    "kiểm": 38,
    "tra": 64,
    "bây": 10,
    "giờ": 25,
    "cho": 12,
    "biết": 5,
    "sensor_001": 56,
    "ở": 90,
    "khu": 34,
    "a": 0,
    "ẩm": 88,
    "thế": 61,
    "nào": 49,
    "của": 22,
    "sensor_002": 57,
    "b": 2,
    "xem": 82,
    "dữ": 23,
    "liệu": 39,
    "biến": 4,
    "thông": 59,
    "tin": 62,
    "từ": 77,
    "đọc": 86,
    "tình": 70,
    "trạng": 68,
    "cần": 21,
    "tư": 72,
    "vấn": 80,
    "gì": 26,
    "hôm": 32,
    "nay": 45,
    "chăm": 17,
    "sóc": 58,
    "trang": 65,
    "trại": 67,
    "nên": 50,
    "làm": 41,
    "lời": 43,
    "khuyên": 35,
    "dựa": 24,
    "trên": 66
  },
  "intent": {
    "greet": 4,
    "bye": 2,
    "affirm": 0,
    "deny": 3,
    "mood_great": 5,
    "mood_unhappy": 6,
    "bot_challenge": 1,
    "request_temperature": 10,
    "request_humidity": 8,
    "request_sensor_data": 9,
    "request_advice": 7
  },
  "response": null,
  "action_name": {
    "action_listen": 8,
    "action_restart": 9,
    "action_session_start": 11,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 10,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 5,
    "action_get_advice": 6,
    "action_get_sensor_data": 7,
    "utter_bye": 14,
    "utter_greet": 15,
    "utter_happy": 16,
    "utter_iamabot": 17
  },
  "action_text": null,
  "intent_response_key": null
}